text_address = '''<b>Адрес:</b>  Россия, Санкт-Петербург, Прачечный пер., 3
<b>Часы работы:</b> 10:00 - 22:00
<b>Телефон:</b> +7 904 333-03-33'''

text_menu_1 = '''Взаимодействие происходит через меню расположенное рядом со строкой вода текста.
В меню есть следующие пункты:
'''

text_menu_2 = '''<b>- Каталог</b>. Список товаров, после добавления попадает в корзину.
<b>- Корзина</b>. Добавленные к покупке товары.
<b>- Заказы</b>. Здесь вы можете отслеживать свои покупки (Номер заказа, список товаров с количеством и ценами, итоговая стоимость, ссылку на оплату, трек номер в транспортной компании)
'''

text_catalog_1 = '''Выберете в каталоге товар и нажмите кнопку «Добавить» или «Убрать», при этом верхней части экрана пишется товар и количество в корзине. Так же можно редактировать количество в самой корзине (информация в разделе Работа с корзиной)'''

text_cart_1 = '''Если у вас есть товары в корзине, откроется форма представленная ниже.'''

text_cart_2 = '''Вы можете редактировать товары, после завершения редактирования нужно нажать кнопку «Обновить» и вас вернет на стартовую форму.'''

text_cart_3 = '''Для оформления заказа требуется пройти несколько шагов оформления:

1. Доставка или самовывоз.

2. Информация о пункте доставки или магазина для самовывоза:
Если с доставкой, у вас появится форма представленная ниже (пожалуйста указывйте как можно точнее адрес):'''

text_cart_4 = '''Если вы еще не указывали адрес или нужно его изменить, напишите сначала адрес в чат, а потом нажать кнопку «Сохранить адрес».
В следующий раз этот адрес будет доступен к выбору (сохраняется только 1 последний адрес).

3. Вид оплаты:'''

text_cart_5 = '''«Через банковское приложение» - вам не пройдется вводить реквизиты карты. (Больше можно узнать в информационном разделе «Об оплате»)

4. Заказать:'''

text_cart_6 = '''«Редактировать» - вы перейдете к вопросу о доставке. Если вам нужно отредактировать товары, просто вызовите еще раз корзину.
 «Заказать» – вы отправите заявку на обработку менеджеру. А так же получите сообщение как представлено ниже (так же увидеть свой заказ вы можете в пункте меню «Заказы»):'''

text_orders_1 = '''В зависимости от статуса заказа отображается соответствующая доп. Информация:
На этапе с оплаты будет ссылка на оплату (после оплаты статус меняется в течение часа):'''

text_orders_2 = '''На этапе доставки будет название транспортной компании и трек номер:'''

text_payment_1 = '''Вся оплата происходит безналично, в момент оформления вы можете выбрать способ оплаты:'''

text_payment_qr_1 = '''Через банковское приложение (по QR коду) – после присвоения менеджером вашей заявке статуса «ожидает оплаты» вы получите сообщение с ссылкой на оплату, так же ее можно посмотреть в пункте меню «Заказы»

При переходе по ссылке вам потребуется указать ФИО, адрес электронной почты для отправки эквайрингового чека, а так же согласие с офертой (оферта доступна по ссылке: <a href="https://disk.yandex.ru/d/kEEogQFL3783Cg"> Оферта </a>)'''

text_payment_qr_2 = '''После заполнения вам выйдет QR код, нажмите на него и у вас откроется банковское.'''

text_payment_qr_3 = '''Если вам нужно оплатить через другое приложение вы можете сделать фотографию экрана и отсканировать в приложении банка.'''

text_payment_qr_4 = '''Поле чего вам выйдет заявка на оплату:'''

text_payment_card_1 = '''Ввести реквизиты – после присвоения менеджером вашей заявке статуса «ожидает оплаты» вы получите сообщение с ссылкой на оплату, так же ее можно посмотреть в пункте меню «Заказы»

При переходе по ссылке вам потребуется ввести реквизиты карты, указать ФИО, адрес электронной почты для отправки эквайрингового чека, а так же согласие с офертой (оферта доступна по ссылке: <a href="https://disk.yandex.ru/d/kEEogQFL3783Cg"> Оферта </a>)'''





